УТ_для_edt/src/Catalogs/смартДЛ_СпециальныеТребования/смартДЛ_СпециальныеТребования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартДЛ_СпециальныеТребования</name>
  <attributes>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Несовместимость</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартДЛ_СпециальныеТребования/ManagerModule.bsl
Функция ПолучитьМассивПоляПоиска() Экспорт 
	
	Возврат смартДеловыеЛинии.МассивДвухЭлементов("uid", "UID");
	
КонецФункции  

Функция ПолучитьТаблицуПолейЗначений() Экспорт
	
	Результат = смартДеловыеЛинии.НоваяТаблицаПолейЗначений();
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "title", "Наименование", "Реквизит"); 
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "name", "Описание", "Реквизит");	
	смартДеловыеЛинии.ДобавитьСтрокуВТаблицуПолейЗначений(Результат, "incompatible", "Несовместимость", "ТабличнаяЧасть", Новый Структура("UID", Неопределено));	
	
	Возврат Результат;
	
КонецФункции
